import {Simpson} from "./Simpson";

let simpsons = [
    {
        id:1,
        name:'Homer',
        img:'https://upload.wikimedia.org/wikipedia/ru/b/bd/Homer_Simpson.png',
        info:'Гомер Джей Сімпсон (народився 12 травня 1956 року) [40] - чоловік зі Спрінгфілда. Він чоловік Мардж Сімпсон та батько Барта, Лізи та Меггі Сімпсон. Гомер має надмірну вагу (сказано, що він важить 239 фунтів) [41], лінивий і часто неосвічений до навколишнього світу. Хоча в нього багато недоліків, він виявив велику турботу, любов і навіть хоробрість до тих, хто небайдужий до нього, а іноді навіть інших, яких він не робить.',
        age:36
    },
    {
       id:2,
       name:'Marge',
       img: 'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png',
       info: 'Марджорі Жаклін «Мардж» Сімпсон (уроджена Був\'є ) [11] (народилася 19 березня) — домогосподарка та матріарх родини Сімпсонів . Вона також є однією з п\'яти головних героїнь серіалу Сімпсони . Вона та її чоловік Гомер мають трьох дітей: Барта , Лізу та Меггі . Мардж є моралізатором у своїй сім’ї, і вона часто дає приземливий голос у розпал сімейних витівок, намагаючись підтримувати порядок у родині Сімпсонів. Крім своїх домашніх обов’язків, Мардж ненадовго загравала з низкою кар’єр, починаючи від офіцера поліції до активістки проти насильства.',
       age: 34
    },
    {
        id:3,
        name:'Bart',
        img: 'https://upload.wikimedia.org/wikipedia/ru/thumb/2/29/Bart_Simpson.gif/270px-Bart_Simpson.gif',
        info: 'Бартолом\'ю ДжоДжо " Барт " Сімпсон (народився 23 лютого чи 1 квітня 1980 года)[7] - бешкетний, бунтівний, незрозумілий, руйнівний і " потенційно небезпечний " старший дитина сім\'ї Сімпсонів в " Сімпсоні " . Він єдиний син Гомера та Мардж Сімпсон та старший брат Лізи та Меггі. Він також отримав прізвисько "Космо" після того, як виявив комету у "Кометі Берта". Барт також був на обкладинці численних коміксів, таких як "Critical Hit", "Simpsons Treasure Trove #11" та "Winter Wingding". Барт також має серію коміксів зі 100 випусків під назвою Simpson Comics Presents Bart Simpson. Барт заснований на Метт Грейнінг і його старшому брату Марку Грейнінг.',
        age: 10
    },
    {
        id:4,
        name:'Lisa',
        img: 'https://upload.wikimedia.org/wikipedia/ru/e/ec/Lisa_Simpson.png',
        info: 'Ліза Марі Сімпсон (народилася 9 травня 1983) - старша дочка і середня дитина сім\'ї Сімпсонів і один з двох тритагоністів (поряд з Мардж) серіалу "Сімпсони". NaN поїзда під назвою Lil\' Lisa на першу річницю її батьків. Вона є харизматичною 8-річною дівчинкою, яка перевершує стандартне досягнення рівня інтелекту дітей свого віку. Не всім дивує, вона також є моральним осередком своєї сім\'ї. У своєму вихованні Лізі не вистачає батьківської участі Гомера та Мардж, що призводить до таких захоплень, як гра на саксофоні та гітарі, верхова їзда та догляд за кіньми, а також інтерес до розвинених досліджень.',
        age: 8
    },
    {
        id:5,
        name:'Maggie',
        img:'https://upload.wikimedia.org/wikipedia/ru/9/9d/Maggie_Simpson.png',
        info: 'Маргарет [8] Ленні [9] «Меггі» Сімпсон — однорічна донька та молодша дитина Мардж і Гомера Сімпсонів , молодша сестра Барта та Лізи Сімпсон і одна з п\'яти головних героїв Сімпсонів . Її часто бачать, як смокче соску, а коли вона ходить, спотикається об свій одяг і падає на обличчя. Оскільки вона рідко розмовляє, Меґі найменше бачать і чують у сім’ї Сімпсонів . Меґі зовсім маленька, їй 1 рік.',
        age:1
    }
]
const Simpsons = () => {
    return (
        <div>
            {simpsons.map(oneSimpson=><Simpson key={oneSimpson.id} arr={oneSimpson}/>)}
        </div>
    );
};

export {Simpsons};